gui_start

set search_path ". /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library"
set link_library "* /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"
set target_library "/research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"


analyze -library WORK -format sverilog {/home/rfebbo/Research/rocco_CSA/simp_pipe_builtin_8.sv /home/rfebbo/Research/rocco_CSA/DPE_params.sv}

elaborate simp_pipe_builtin_8 -architecture verilog -library WORK

link

create_clock -name "CLK" -period 10 -waveform { 0 5  }  { clk  }


# 32-bit
set_input_delay -clock CLK  -max -rise 0.5 "{in[0][28]} {in[1][27]} {in[3][29]} {in[0][18]} {in[1][17]} {in[3][19]} {in[0][25]} {in[1][28]} {in[2][27]} {in[4][29]} {in[0][15]} {in[1][18]} {in[2][17]} {in[4][19]} {in[0][0]} {in[1][0]} {in[2][0]} {in[3][0]} {in[4][0]} {in[5][0]} {in[6][0]} {in[7][0]} {in[3][27]} {in[0][26]} {in[1][25]} {in[2][28]} {in[5][29]} {in[3][17]} {in[0][16]} {in[1][15]} {in[2][18]} {in[5][19]} rst_n {in[0][1]} {in[1][1]} {in[2][1]} {in[3][1]} {in[4][1]} {in[5][1]} {in[6][1]} {in[7][1]} {in[3][28]} {in[0][23]} {in[1][26]} {in[2][25]} {in[4][27]} {in[6][29]} {in[2][15]} {in[3][18]} {in[0][13]} {in[1][16]} {in[4][17]} {in[6][19]} {in[0][2]} {in[1][2]} {in[2][2]} {in[3][2]} {in[4][2]} {in[5][2]} {in[6][2]} {in[7][2]} {in[2][26]} {in[3][25]} {in[0][24]} {in[1][23]} {in[4][28]} {in[5][27]} {in[7][29]} {in[2][16]} {in[3][15]} {in[0][14]} {in[1][13]} {in[4][18]} {in[5][17]} {in[7][19]} {in[0][3]} {in[1][3]} {in[2][3]} {in[3][3]} {in[4][3]} {in[5][3]} {in[6][3]} {in[7][3]} {in[2][23]} {in[3][26]} {in[0][31]} {in[1][24]} {in[4][25]} {in[5][28]} {in[6][27]} {in[2][13]} {in[3][16]} {in[0][21]} {in[1][14]} {in[4][15]} {in[5][18]} {in[6][17]} {in[0][11]} {in[0][4]} {in[1][4]} {in[2][4]} {in[3][4]} {in[4][4]} {in[5][4]} {in[6][4]} {in[7][4]} {in[1][31]} {in[2][24]} {in[3][23]} {in[4][26]} {in[5][25]} {in[6][28]} {in[7][27]} {in[1][21]} {in[2][14]} {in[3][13]} {in[0][22]} {in[4][16]} {in[5][15]} {in[6][18]} {in[7][17]} {in[1][11]} {in[0][12]} {in[0][5]} {in[1][5]} {in[2][5]} {in[3][5]} {in[4][5]} {in[5][5]} {in[6][5]} {in[7][5]} {in[2][31]} {in[3][24]} {in[4][23]} {in[5][26]} {in[6][25]} {in[7][28]} {in[1][22]} {in[2][21]} {in[3][14]} {in[4][13]} {in[5][16]} {in[6][15]} {in[7][18]} {in[1][12]} {in[2][11]} {in[0][6]} {in[1][6]} {in[2][6]} {in[3][6]} {in[4][6]} {in[5][6]} {in[6][6]} {in[7][6]} {in[0][30]} {in[3][31]} {in[4][24]} {in[5][23]} {in[6][26]} {in[7][25]} {in[0][20]} {in[2][22]} {in[3][21]} {in[4][14]} {in[5][13]} {in[6][16]} {in[7][15]} {in[0][10]} {in[2][12]} {in[3][11]} {in[0][7]} {in[1][7]} {in[2][7]} {in[3][7]} {in[4][7]} {in[5][7]} {in[6][7]} {in[7][7]} {in[1][30]} {in[4][31]} {in[5][24]} {in[6][23]} {in[7][26]} {in[3][22]} {in[1][20]} {in[4][21]} {in[5][14]} {in[6][13]} {in[7][16]} {in[3][12]} {in[1][10]} {in[4][11]} {in[0][8]} {in[1][8]} {in[2][8]} {in[3][8]} {in[4][8]} {in[5][8]} {in[6][8]} {in[7][8]} {in[2][30]} {in[5][31]} {in[6][24]} {in[7][23]} {in[2][20]} {in[4][22]} {in[5][21]} {in[6][14]} {in[7][13]} {in[2][10]} {in[4][12]} {in[5][11]} {in[0][9]} {in[1][9]} {in[2][9]} {in[3][9]} {in[4][9]} {in[5][9]} {in[6][9]} {in[7][9]} {in[3][30]} {in[6][31]} {in[7][24]} {in[3][20]} {in[5][22]} {in[6][21]} {in[7][14]} {in[3][10]} {in[5][12]} {in[6][11]} {in[4][30]} {in[7][31]} {in[4][20]} {in[6][22]} {in[7][21]} {in[4][10]} {in[6][12]} {in[7][11]} {in[5][30]} {in[0][29]} {in[5][20]} {in[7][22]} {in[0][19]} {in[5][10]} {in[7][12]} {in[6][30]} {in[1][29]} {in[6][20]} {in[1][19]} {in[6][10]} {in[7][30]} {in[2][29]} {in[0][27]} {in[7][20]} {in[2][19]} {in[0][17]} {in[7][10]}"
set_input_delay -clock CLK -max -fall 0.5 "{in[0][28]} {in[1][27]} {in[3][29]} {in[0][18]} {in[1][17]} {in[3][19]} {in[0][25]} {in[1][28]} {in[2][27]} {in[4][29]} {in[0][15]} {in[1][18]} {in[2][17]} {in[4][19]} {in[0][0]} {in[1][0]} {in[2][0]} {in[3][0]} {in[4][0]} {in[5][0]} {in[6][0]} {in[7][0]} {in[3][27]} {in[0][26]} {in[1][25]} {in[2][28]} {in[5][29]} {in[3][17]} {in[0][16]} {in[1][15]} {in[2][18]} {in[5][19]} rst_n {in[0][1]} {in[1][1]} {in[2][1]} {in[3][1]} {in[4][1]} {in[5][1]} {in[6][1]} {in[7][1]} {in[3][28]} {in[0][23]} {in[1][26]} {in[2][25]} {in[4][27]} {in[6][29]} {in[2][15]} {in[3][18]} {in[0][13]} {in[1][16]} {in[4][17]} {in[6][19]} {in[0][2]} {in[1][2]} {in[2][2]} {in[3][2]} {in[4][2]} {in[5][2]} {in[6][2]} {in[7][2]} {in[2][26]} {in[3][25]} {in[0][24]} {in[1][23]} {in[4][28]} {in[5][27]} {in[7][29]} {in[2][16]} {in[3][15]} {in[0][14]} {in[1][13]} {in[4][18]} {in[5][17]} {in[7][19]} {in[0][3]} {in[1][3]} {in[2][3]} {in[3][3]} {in[4][3]} {in[5][3]} {in[6][3]} {in[7][3]} {in[2][23]} {in[3][26]} {in[0][31]} {in[1][24]} {in[4][25]} {in[5][28]} {in[6][27]} {in[2][13]} {in[3][16]} {in[0][21]} {in[1][14]} {in[4][15]} {in[5][18]} {in[6][17]} {in[0][11]} {in[0][4]} {in[1][4]} {in[2][4]} {in[3][4]} {in[4][4]} {in[5][4]} {in[6][4]} {in[7][4]} {in[1][31]} {in[2][24]} {in[3][23]} {in[4][26]} {in[5][25]} {in[6][28]} {in[7][27]} {in[1][21]} {in[2][14]} {in[3][13]} {in[0][22]} {in[4][16]} {in[5][15]} {in[6][18]} {in[7][17]} {in[1][11]} {in[0][12]} {in[0][5]} {in[1][5]} {in[2][5]} {in[3][5]} {in[4][5]} {in[5][5]} {in[6][5]} {in[7][5]} {in[2][31]} {in[3][24]} {in[4][23]} {in[5][26]} {in[6][25]} {in[7][28]} {in[1][22]} {in[2][21]} {in[3][14]} {in[4][13]} {in[5][16]} {in[6][15]} {in[7][18]} {in[1][12]} {in[2][11]} {in[0][6]} {in[1][6]} {in[2][6]} {in[3][6]} {in[4][6]} {in[5][6]} {in[6][6]} {in[7][6]} {in[0][30]} {in[3][31]} {in[4][24]} {in[5][23]} {in[6][26]} {in[7][25]} {in[0][20]} {in[2][22]} {in[3][21]} {in[4][14]} {in[5][13]} {in[6][16]} {in[7][15]} {in[0][10]} {in[2][12]} {in[3][11]} {in[0][7]} {in[1][7]} {in[2][7]} {in[3][7]} {in[4][7]} {in[5][7]} {in[6][7]} {in[7][7]} {in[1][30]} {in[4][31]} {in[5][24]} {in[6][23]} {in[7][26]} {in[3][22]} {in[1][20]} {in[4][21]} {in[5][14]} {in[6][13]} {in[7][16]} {in[3][12]} {in[1][10]} {in[4][11]} {in[0][8]} {in[1][8]} {in[2][8]} {in[3][8]} {in[4][8]} {in[5][8]} {in[6][8]} {in[7][8]} {in[2][30]} {in[5][31]} {in[6][24]} {in[7][23]} {in[2][20]} {in[4][22]} {in[5][21]} {in[6][14]} {in[7][13]} {in[2][10]} {in[4][12]} {in[5][11]} {in[0][9]} {in[1][9]} {in[2][9]} {in[3][9]} {in[4][9]} {in[5][9]} {in[6][9]} {in[7][9]} {in[3][30]} {in[6][31]} {in[7][24]} {in[3][20]} {in[5][22]} {in[6][21]} {in[7][14]} {in[3][10]} {in[5][12]} {in[6][11]} {in[4][30]} {in[7][31]} {in[4][20]} {in[6][22]} {in[7][21]} {in[4][10]} {in[6][12]} {in[7][11]} {in[5][30]} {in[0][29]} {in[5][20]} {in[7][22]} {in[0][19]} {in[5][10]} {in[7][12]} {in[6][30]} {in[1][29]} {in[6][20]} {in[1][19]} {in[6][10]} {in[7][30]} {in[2][29]} {in[0][27]} {in[7][20]} {in[2][19]} {in[0][17]} {in[7][10]}"
set_input_delay -clock CLK -min -rise 0.5 "{in[0][28]} {in[1][27]} {in[3][29]} {in[0][18]} {in[1][17]} {in[3][19]} {in[0][25]} {in[1][28]} {in[2][27]} {in[4][29]} {in[0][15]} {in[1][18]} {in[2][17]} {in[4][19]} {in[0][0]} {in[1][0]} {in[2][0]} {in[3][0]} {in[4][0]} {in[5][0]} {in[6][0]} {in[7][0]} {in[3][27]} {in[0][26]} {in[1][25]} {in[2][28]} {in[5][29]} {in[3][17]} {in[0][16]} {in[1][15]} {in[2][18]} {in[5][19]} rst_n {in[0][1]} {in[1][1]} {in[2][1]} {in[3][1]} {in[4][1]} {in[5][1]} {in[6][1]} {in[7][1]} {in[3][28]} {in[0][23]} {in[1][26]} {in[2][25]} {in[4][27]} {in[6][29]} {in[2][15]} {in[3][18]} {in[0][13]} {in[1][16]} {in[4][17]} {in[6][19]} {in[0][2]} {in[1][2]} {in[2][2]} {in[3][2]} {in[4][2]} {in[5][2]} {in[6][2]} {in[7][2]} {in[2][26]} {in[3][25]} {in[0][24]} {in[1][23]} {in[4][28]} {in[5][27]} {in[7][29]} {in[2][16]} {in[3][15]} {in[0][14]} {in[1][13]} {in[4][18]} {in[5][17]} {in[7][19]} {in[0][3]} {in[1][3]} {in[2][3]} {in[3][3]} {in[4][3]} {in[5][3]} {in[6][3]} {in[7][3]} {in[2][23]} {in[3][26]} {in[0][31]} {in[1][24]} {in[4][25]} {in[5][28]} {in[6][27]} {in[2][13]} {in[3][16]} {in[0][21]} {in[1][14]} {in[4][15]} {in[5][18]} {in[6][17]} {in[0][11]} {in[0][4]} {in[1][4]} {in[2][4]} {in[3][4]} {in[4][4]} {in[5][4]} {in[6][4]} {in[7][4]} {in[1][31]} {in[2][24]} {in[3][23]} {in[4][26]} {in[5][25]} {in[6][28]} {in[7][27]} {in[1][21]} {in[2][14]} {in[3][13]} {in[0][22]} {in[4][16]} {in[5][15]} {in[6][18]} {in[7][17]} {in[1][11]} {in[0][12]} {in[0][5]} {in[1][5]} {in[2][5]} {in[3][5]} {in[4][5]} {in[5][5]} {in[6][5]} {in[7][5]} {in[2][31]} {in[3][24]} {in[4][23]} {in[5][26]} {in[6][25]} {in[7][28]} {in[1][22]} {in[2][21]} {in[3][14]} {in[4][13]} {in[5][16]} {in[6][15]} {in[7][18]} {in[1][12]} {in[2][11]} {in[0][6]} {in[1][6]} {in[2][6]} {in[3][6]} {in[4][6]} {in[5][6]} {in[6][6]} {in[7][6]} {in[0][30]} {in[3][31]} {in[4][24]} {in[5][23]} {in[6][26]} {in[7][25]} {in[0][20]} {in[2][22]} {in[3][21]} {in[4][14]} {in[5][13]} {in[6][16]} {in[7][15]} {in[0][10]} {in[2][12]} {in[3][11]} {in[0][7]} {in[1][7]} {in[2][7]} {in[3][7]} {in[4][7]} {in[5][7]} {in[6][7]} {in[7][7]} {in[1][30]} {in[4][31]} {in[5][24]} {in[6][23]} {in[7][26]} {in[3][22]} {in[1][20]} {in[4][21]} {in[5][14]} {in[6][13]} {in[7][16]} {in[3][12]} {in[1][10]} {in[4][11]} {in[0][8]} {in[1][8]} {in[2][8]} {in[3][8]} {in[4][8]} {in[5][8]} {in[6][8]} {in[7][8]} {in[2][30]} {in[5][31]} {in[6][24]} {in[7][23]} {in[2][20]} {in[4][22]} {in[5][21]} {in[6][14]} {in[7][13]} {in[2][10]} {in[4][12]} {in[5][11]} {in[0][9]} {in[1][9]} {in[2][9]} {in[3][9]} {in[4][9]} {in[5][9]} {in[6][9]} {in[7][9]} {in[3][30]} {in[6][31]} {in[7][24]} {in[3][20]} {in[5][22]} {in[6][21]} {in[7][14]} {in[3][10]} {in[5][12]} {in[6][11]} {in[4][30]} {in[7][31]} {in[4][20]} {in[6][22]} {in[7][21]} {in[4][10]} {in[6][12]} {in[7][11]} {in[5][30]} {in[0][29]} {in[5][20]} {in[7][22]} {in[0][19]} {in[5][10]} {in[7][12]} {in[6][30]} {in[1][29]} {in[6][20]} {in[1][19]} {in[6][10]} {in[7][30]} {in[2][29]} {in[0][27]} {in[7][20]} {in[2][19]} {in[0][17]} {in[7][10]}"
set_input_delay -clock CLK  -min -fall 0.5 "{in[0][28]} {in[1][27]} {in[3][29]} {in[0][18]} {in[1][17]} {in[3][19]} {in[0][25]} {in[1][28]} {in[2][27]} {in[4][29]} {in[0][15]} {in[1][18]} {in[2][17]} {in[4][19]} {in[0][0]} {in[1][0]} {in[2][0]} {in[3][0]} {in[4][0]} {in[5][0]} {in[6][0]} {in[7][0]} {in[3][27]} {in[0][26]} {in[1][25]} {in[2][28]} {in[5][29]} {in[3][17]} {in[0][16]} {in[1][15]} {in[2][18]} {in[5][19]} rst_n {in[0][1]} {in[1][1]} {in[2][1]} {in[3][1]} {in[4][1]} {in[5][1]} {in[6][1]} {in[7][1]} {in[3][28]} {in[0][23]} {in[1][26]} {in[2][25]} {in[4][27]} {in[6][29]} {in[2][15]} {in[3][18]} {in[0][13]} {in[1][16]} {in[4][17]} {in[6][19]} {in[0][2]} {in[1][2]} {in[2][2]} {in[3][2]} {in[4][2]} {in[5][2]} {in[6][2]} {in[7][2]} {in[2][26]} {in[3][25]} {in[0][24]} {in[1][23]} {in[4][28]} {in[5][27]} {in[7][29]} {in[2][16]} {in[3][15]} {in[0][14]} {in[1][13]} {in[4][18]} {in[5][17]} {in[7][19]} {in[0][3]} {in[1][3]} {in[2][3]} {in[3][3]} {in[4][3]} {in[5][3]} {in[6][3]} {in[7][3]} {in[2][23]} {in[3][26]} {in[0][31]} {in[1][24]} {in[4][25]} {in[5][28]} {in[6][27]} {in[2][13]} {in[3][16]} {in[0][21]} {in[1][14]} {in[4][15]} {in[5][18]} {in[6][17]} {in[0][11]} {in[0][4]} {in[1][4]} {in[2][4]} {in[3][4]} {in[4][4]} {in[5][4]} {in[6][4]} {in[7][4]} {in[1][31]} {in[2][24]} {in[3][23]} {in[4][26]} {in[5][25]} {in[6][28]} {in[7][27]} {in[1][21]} {in[2][14]} {in[3][13]} {in[0][22]} {in[4][16]} {in[5][15]} {in[6][18]} {in[7][17]} {in[1][11]} {in[0][12]} {in[0][5]} {in[1][5]} {in[2][5]} {in[3][5]} {in[4][5]} {in[5][5]} {in[6][5]} {in[7][5]} {in[2][31]} {in[3][24]} {in[4][23]} {in[5][26]} {in[6][25]} {in[7][28]} {in[1][22]} {in[2][21]} {in[3][14]} {in[4][13]} {in[5][16]} {in[6][15]} {in[7][18]} {in[1][12]} {in[2][11]} {in[0][6]} {in[1][6]} {in[2][6]} {in[3][6]} {in[4][6]} {in[5][6]} {in[6][6]} {in[7][6]} {in[0][30]} {in[3][31]} {in[4][24]} {in[5][23]} {in[6][26]} {in[7][25]} {in[0][20]} {in[2][22]} {in[3][21]} {in[4][14]} {in[5][13]} {in[6][16]} {in[7][15]} {in[0][10]} {in[2][12]} {in[3][11]} {in[0][7]} {in[1][7]} {in[2][7]} {in[3][7]} {in[4][7]} {in[5][7]} {in[6][7]} {in[7][7]} {in[1][30]} {in[4][31]} {in[5][24]} {in[6][23]} {in[7][26]} {in[3][22]} {in[1][20]} {in[4][21]} {in[5][14]} {in[6][13]} {in[7][16]} {in[3][12]} {in[1][10]} {in[4][11]} {in[0][8]} {in[1][8]} {in[2][8]} {in[3][8]} {in[4][8]} {in[5][8]} {in[6][8]} {in[7][8]} {in[2][30]} {in[5][31]} {in[6][24]} {in[7][23]} {in[2][20]} {in[4][22]} {in[5][21]} {in[6][14]} {in[7][13]} {in[2][10]} {in[4][12]} {in[5][11]} {in[0][9]} {in[1][9]} {in[2][9]} {in[3][9]} {in[4][9]} {in[5][9]} {in[6][9]} {in[7][9]} {in[3][30]} {in[6][31]} {in[7][24]} {in[3][20]} {in[5][22]} {in[6][21]} {in[7][14]} {in[3][10]} {in[5][12]} {in[6][11]} {in[4][30]} {in[7][31]} {in[4][20]} {in[6][22]} {in[7][21]} {in[4][10]} {in[6][12]} {in[7][11]} {in[5][30]} {in[0][29]} {in[5][20]} {in[7][22]} {in[0][19]} {in[5][10]} {in[7][12]} {in[6][30]} {in[1][29]} {in[6][20]} {in[1][19]} {in[6][10]} {in[7][30]} {in[2][29]} {in[0][27]} {in[7][20]} {in[2][19]} {in[0][17]} {in[7][10]}"
set_output_delay -clock CLK  -max -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK -max -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK -min -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK  -min -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"


# 8-bit
#set_input_delay -clock CLK  -max -rise 0.5 "{in[1][1]} {in[3][4]} rst_n {in[5][7]} {in[0][6]} {in[3][0]} {in[5][3]} {in[0][2]} {in[7][6]} {in[2][5]} {in[7][2]} {in[2][1]} {in[4][4]} {in[6][7]} {in[1][6]} {in[4][0]} {in[6][3]} {in[1][2]} {in[3][5]} {in[0][7]} {in[3][1]} {in[5][4]} {in[0][3]} {in[7][7]} {in[2][6]} {in[5][0]} {in[7][3]} {in[2][2]} {in[4][5]} {in[1][7]} {in[4][1]} {in[6][4]} {in[1][3]} {in[3][6]} {in[6][0]} {in[3][2]} {in[5][5]} {in[0][4]} {in[2][7]} {in[5][1]} {in[0][0]} {in[7][4]} {in[2][3]} {in[4][6]} {in[7][0]} {in[4][2]} {in[6][5]} {in[1][4]} {in[3][7]} {in[6][1]} {in[1][0]} {in[3][3]} {in[5][6]} {in[0][5]} {in[5][2]} {in[0][1]} {in[7][5]} {in[2][4]} {in[4][7]} {in[7][1]} {in[2][0]} {in[4][3]} {in[6][6]} {in[1][5]} {in[6][2]}"
#set_input_delay -clock CLK -max -fall 0.5 "{in[1][1]} {in[3][4]} rst_n {in[5][7]} {in[0][6]} {in[3][0]} {in[5][3]} {in[0][2]} {in[7][6]} {in[2][5]} {in[7][2]} {in[2][1]} {in[4][4]} {in[6][7]} {in[1][6]} {in[4][0]} {in[6][3]} {in[1][2]} {in[3][5]} {in[0][7]} {in[3][1]} {in[5][4]} {in[0][3]} {in[7][7]} {in[2][6]} {in[5][0]} {in[7][3]} {in[2][2]} {in[4][5]} {in[1][7]} {in[4][1]} {in[6][4]} {in[1][3]} {in[3][6]} {in[6][0]} {in[3][2]} {in[5][5]} {in[0][4]} {in[2][7]} {in[5][1]} {in[0][0]} {in[7][4]} {in[2][3]} {in[4][6]} {in[7][0]} {in[4][2]} {in[6][5]} {in[1][4]} {in[3][7]} {in[6][1]} {in[1][0]} {in[3][3]} {in[5][6]} {in[0][5]} {in[5][2]} {in[0][1]} {in[7][5]} {in[2][4]} {in[4][7]} {in[7][1]} {in[2][0]} {in[4][3]} {in[6][6]} {in[1][5]} {in[6][2]}"
#set_input_delay -clock CLK -min -rise 0.5 "{in[1][1]} {in[3][4]} rst_n {in[5][7]} {in[0][6]} {in[3][0]} {in[5][3]} {in[0][2]} {in[7][6]} {in[2][5]} {in[7][2]} {in[2][1]} {in[4][4]} {in[6][7]} {in[1][6]} {in[4][0]} {in[6][3]} {in[1][2]} {in[3][5]} {in[0][7]} {in[3][1]} {in[5][4]} {in[0][3]} {in[7][7]} {in[2][6]} {in[5][0]} {in[7][3]} {in[2][2]} {in[4][5]} {in[1][7]} {in[4][1]} {in[6][4]} {in[1][3]} {in[3][6]} {in[6][0]} {in[3][2]} {in[5][5]} {in[0][4]} {in[2][7]} {in[5][1]} {in[0][0]} {in[7][4]} {in[2][3]} {in[4][6]} {in[7][0]} {in[4][2]} {in[6][5]} {in[1][4]} {in[3][7]} {in[6][1]} {in[1][0]} {in[3][3]} {in[5][6]} {in[0][5]} {in[5][2]} {in[0][1]} {in[7][5]} {in[2][4]} {in[4][7]} {in[7][1]} {in[2][0]} {in[4][3]} {in[6][6]} {in[1][5]} {in[6][2]}"
#set_input_delay -clock CLK  -min -fall 0.5 "{in[1][1]} {in[3][4]} rst_n {in[5][7]} {in[0][6]} {in[3][0]} {in[5][3]} {in[0][2]} {in[7][6]} {in[2][5]} {in[7][2]} {in[2][1]} {in[4][4]} {in[6][7]} {in[1][6]} {in[4][0]} {in[6][3]} {in[1][2]} {in[3][5]} {in[0][7]} {in[3][1]} {in[5][4]} {in[0][3]} {in[7][7]} {in[2][6]} {in[5][0]} {in[7][3]} {in[2][2]} {in[4][5]} {in[1][7]} {in[4][1]} {in[6][4]} {in[1][3]} {in[3][6]} {in[6][0]} {in[3][2]} {in[5][5]} {in[0][4]} {in[2][7]} {in[5][1]} {in[0][0]} {in[7][4]} {in[2][3]} {in[4][6]} {in[7][0]} {in[4][2]} {in[6][5]} {in[1][4]} {in[3][7]} {in[6][1]} {in[1][0]} {in[3][3]} {in[5][6]} {in[0][5]} {in[5][2]} {in[0][1]} {in[7][5]} {in[2][4]} {in[4][7]} {in[7][1]} {in[2][0]} {in[4][3]} {in[6][6]} {in[1][5]} {in[6][2]}"

# set_output_delay -clock CLK  -max -rise 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK -max -fall 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK -min -rise 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK  -min -fall 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK  -max -rise 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK -max -fall 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK -min -rise 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"
# set_output_delay -clock CLK  -min -fall 0.2 "{s[4]} {s[3]} {s[2]} {s[1]} {s[0]} {s[7]} {s[6]} {s[5]}"

compile_ultra

write -f verilog -h -o builtin_8_GLN.v

write_sdf builtin_8_GLN.sdf
write_sdc builtin_8_GLN.sdc

# Warning: Unexpected level numbers (Fanout Level is more than Fanin):
#         Optimized cell DP_OP_24J1_122_5627/U47, level = 14
#         Fanout cell DP_OP_24J1_122_5627/U47, level = 14