gui_start

set search_path ". /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library"
set link_library "* /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"
set target_library "/research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"

analyze -library WORK -format sverilog {/home/rfebbo/Research/rocco_CSA/simp_pipe_csa_4_nocout.sv /home/rfebbo/Research/rocco_CSA/CSA_4_nocout.sv /home/rfebbo/Research/rocco_CSA/RCA_nocout.sv /home/rfebbo/Research/rocco_CSA/FA.sv /home/rfebbo/Research/rocco_CSA/FA_nocout.sv}

elaborate simp_pipe_csa_4_nocout -architecture verilog -library WORK

link

create_clock -name "CLK_0" -period 10 -waveform { 0 5  }  { clk  }
set_input_delay -clock CLK_0  -max -rise 0.5 "{c[22]} {b[12]} {c[12]} {d[22]} {d[12]} {c[3]} {a[1]} {d[4]} {b[2]} {a[23]} {a[13]} {b[23]} {c[23]} {b[13]} {c[13]} {d[23]} {d[13]} {c[4]} {a[2]} {d[5]} {b[3]} {a[24]} {b[24]} {a[14]} {b[14]} {c[24]} {c[14]} {d[24]} {d[14]} {b[4]} {c[5]} {a[3]} {d[6]} rst_n {a[25]} {b[25]} {a[15]} {b[15]} {c[25]} {c[15]} {d[25]} {d[15]} {b[5]} {c[6]} {a[4]} {d[7]} {a[26]} {a[16]} {b[26]} {b[16]} {c[26]} {c[16]} {d[26]} {d[16]} {d[8]} {b[6]} {c[7]} {a[5]} {a[27]} {a[17]} {b[27]} {b[17]} {c[27]} {c[17]} {d[27]} {d[17]} {a[6]} {d[9]} {b[7]} {c[8]} {a[28]} {a[18]} {b[28]} {b[18]} {c[28]} {d[28]} {c[18]} {d[18]} {a[7]} {b[8]} {c[9]} {a[29]} {a[19]} {b[29]} {b[19]} {c[29]} {d[29]} {c[19]} {d[19]} {a[8]} {b[9]} {a[9]} {d[0]} {d[1]} {c[0]} {a[30]} {a[20]} {b[30]} {a[10]} {b[20]} {c[30]} {d[30]} {b[10]} {c[20]} {d[20]} {c[10]} {d[10]} {d[2]} {b[0]} {c[1]} {a[31]} {a[21]} {b[31]} {a[11]} {b[21]} {c[31]} {d[31]} {b[11]} {c[21]} {d[21]} {c[11]} {d[11]} {c[2]} {a[0]} {d[3]} {b[1]} {a[22]} {a[12]} {b[22]}"
set_input_delay -clock CLK_0 -max -fall 0.5 "{c[22]} {b[12]} {c[12]} {d[22]} {d[12]} {c[3]} {a[1]} {d[4]} {b[2]} {a[23]} {a[13]} {b[23]} {c[23]} {b[13]} {c[13]} {d[23]} {d[13]} {c[4]} {a[2]} {d[5]} {b[3]} {a[24]} {b[24]} {a[14]} {b[14]} {c[24]} {c[14]} {d[24]} {d[14]} {b[4]} {c[5]} {a[3]} {d[6]} rst_n {a[25]} {b[25]} {a[15]} {b[15]} {c[25]} {c[15]} {d[25]} {d[15]} {b[5]} {c[6]} {a[4]} {d[7]} {a[26]} {a[16]} {b[26]} {b[16]} {c[26]} {c[16]} {d[26]} {d[16]} {d[8]} {b[6]} {c[7]} {a[5]} {a[27]} {a[17]} {b[27]} {b[17]} {c[27]} {c[17]} {d[27]} {d[17]} {a[6]} {d[9]} {b[7]} {c[8]} {a[28]} {a[18]} {b[28]} {b[18]} {c[28]} {d[28]} {c[18]} {d[18]} {a[7]} {b[8]} {c[9]} {a[29]} {a[19]} {b[29]} {b[19]} {c[29]} {d[29]} {c[19]} {d[19]} {a[8]} {b[9]} {a[9]} {d[0]} {d[1]} {c[0]} {a[30]} {a[20]} {b[30]} {a[10]} {b[20]} {c[30]} {d[30]} {b[10]} {c[20]} {d[20]} {c[10]} {d[10]} {d[2]} {b[0]} {c[1]} {a[31]} {a[21]} {b[31]} {a[11]} {b[21]} {c[31]} {d[31]} {b[11]} {c[21]} {d[21]} {c[11]} {d[11]} {c[2]} {a[0]} {d[3]} {b[1]} {a[22]} {a[12]} {b[22]}"
set_input_delay -clock CLK_0 -min -rise 0.5 "{c[22]} {b[12]} {c[12]} {d[22]} {d[12]} {c[3]} {a[1]} {d[4]} {b[2]} {a[23]} {a[13]} {b[23]} {c[23]} {b[13]} {c[13]} {d[23]} {d[13]} {c[4]} {a[2]} {d[5]} {b[3]} {a[24]} {b[24]} {a[14]} {b[14]} {c[24]} {c[14]} {d[24]} {d[14]} {b[4]} {c[5]} {a[3]} {d[6]} rst_n {a[25]} {b[25]} {a[15]} {b[15]} {c[25]} {c[15]} {d[25]} {d[15]} {b[5]} {c[6]} {a[4]} {d[7]} {a[26]} {a[16]} {b[26]} {b[16]} {c[26]} {c[16]} {d[26]} {d[16]} {d[8]} {b[6]} {c[7]} {a[5]} {a[27]} {a[17]} {b[27]} {b[17]} {c[27]} {c[17]} {d[27]} {d[17]} {a[6]} {d[9]} {b[7]} {c[8]} {a[28]} {a[18]} {b[28]} {b[18]} {c[28]} {d[28]} {c[18]} {d[18]} {a[7]} {b[8]} {c[9]} {a[29]} {a[19]} {b[29]} {b[19]} {c[29]} {d[29]} {c[19]} {d[19]} {a[8]} {b[9]} {a[9]} {d[0]} {d[1]} {c[0]} {a[30]} {a[20]} {b[30]} {a[10]} {b[20]} {c[30]} {d[30]} {b[10]} {c[20]} {d[20]} {c[10]} {d[10]} {d[2]} {b[0]} {c[1]} {a[31]} {a[21]} {b[31]} {a[11]} {b[21]} {c[31]} {d[31]} {b[11]} {c[21]} {d[21]} {c[11]} {d[11]} {c[2]} {a[0]} {d[3]} {b[1]} {a[22]} {a[12]} {b[22]}"
set_input_delay -clock CLK_0  -min -fall 0.5 "{c[22]} {b[12]} {c[12]} {d[22]} {d[12]} {c[3]} {a[1]} {d[4]} {b[2]} {a[23]} {a[13]} {b[23]} {c[23]} {b[13]} {c[13]} {d[23]} {d[13]} {c[4]} {a[2]} {d[5]} {b[3]} {a[24]} {b[24]} {a[14]} {b[14]} {c[24]} {c[14]} {d[24]} {d[14]} {b[4]} {c[5]} {a[3]} {d[6]} rst_n {a[25]} {b[25]} {a[15]} {b[15]} {c[25]} {c[15]} {d[25]} {d[15]} {b[5]} {c[6]} {a[4]} {d[7]} {a[26]} {a[16]} {b[26]} {b[16]} {c[26]} {c[16]} {d[26]} {d[16]} {d[8]} {b[6]} {c[7]} {a[5]} {a[27]} {a[17]} {b[27]} {b[17]} {c[27]} {c[17]} {d[27]} {d[17]} {a[6]} {d[9]} {b[7]} {c[8]} {a[28]} {a[18]} {b[28]} {b[18]} {c[28]} {d[28]} {c[18]} {d[18]} {a[7]} {b[8]} {c[9]} {a[29]} {a[19]} {b[29]} {b[19]} {c[29]} {d[29]} {c[19]} {d[19]} {a[8]} {b[9]} {a[9]} {d[0]} {d[1]} {c[0]} {a[30]} {a[20]} {b[30]} {a[10]} {b[20]} {c[30]} {d[30]} {b[10]} {c[20]} {d[20]} {c[10]} {d[10]} {d[2]} {b[0]} {c[1]} {a[31]} {a[21]} {b[31]} {a[11]} {b[21]} {c[31]} {d[31]} {b[11]} {c[21]} {d[21]} {c[11]} {d[11]} {c[2]} {a[0]} {d[3]} {b[1]} {a[22]} {a[12]} {b[22]}"


set_output_delay -clock CLK_0  -max -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0 -max -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0 -min -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0  -min -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"

compile_ultra

write -f verilog -h -o csa_4_nocout_GLN.v

write_sdf csa_4_nocout_GLN.sdf
write_sdc csa_4_nocout_GLN.sdc