gui_start

set search_path ". /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library"
set link_library "* /research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"
set target_library "/research/seneca/DesignFlow-TSMC65/liberate-generated-20201027/library/stdlib_tsmc65_ccs_20201027.db"

analyze -library WORK -format sverilog {/home/rfebbo/Research/rocco_CSA/simp_pipe_csa.sv /home/rfebbo/Research/rocco_CSA/CSA_3.sv /home/rfebbo/Research/rocco_CSA/RCA.sv /home/rfebbo/Research/rocco_CSA/FA.sv}

elaborate simp_pipe_csa -architecture verilog -library WORK

link

create_clock -name "CLK_0" -period 10 -waveform { 0 5  }  { clk  }
set_input_delay -clock CLK_0  -max -rise 0.5 "{b[24]} {a[16]} {c[22]} {a[6]} {b[14]} {b[4]} {c[12]} {c[2]} {a[27]} {b[25]} {a[17]} {c[23]} {a[7]} {b[15]} rst_n {b[5]} {a[30]} {c[13]} {c[3]} {a[28]} {a[20]} {b[26]} {a[18]} {c[24]} {a[8]} {a[10]} {b[16]} {b[6]} {a[0]} {a[31]} {c[14]} {c[4]} {a[29]} {a[21]} {b[27]} {a[19]} {c[25]} {a[11]} {a[9]} {b[17]} {b[7]} {a[1]} {c[15]} {c[5]} {b[30]} {a[22]} {b[28]} {b[20]} {c[26]} {a[12]} {b[18]} {a[2]} {b[8]} {b[10]} {c[16]} {b[0]} {c[6]} {b[31]} {a[23]} {b[29]} {b[21]} {c[27]} {a[13]} {b[19]} {a[3]} {b[9]} {b[11]} {c[17]} {b[1]} {c[7]} {a[24]} {c[30]} c_in {b[22]} {c[28]} {a[14]} {c[20]} {a[4]} {b[12]} {c[18]} {b[2]} {c[8]} {c[10]} {c[0]} {a[25]} {c[31]} {b[23]} {c[29]} {a[15]} {c[21]} {a[5]} {b[13]} {c[19]} {b[3]} {c[9]} {c[11]} {c[1]} {a[26]}"
set_input_delay -clock CLK_0 -max -fall 0.5 "{b[24]} {a[16]} {c[22]} {a[6]} {b[14]} {b[4]} {c[12]} {c[2]} {a[27]} {b[25]} {a[17]} {c[23]} {a[7]} {b[15]} rst_n {b[5]} {a[30]} {c[13]} {c[3]} {a[28]} {a[20]} {b[26]} {a[18]} {c[24]} {a[8]} {a[10]} {b[16]} {b[6]} {a[0]} {a[31]} {c[14]} {c[4]} {a[29]} {a[21]} {b[27]} {a[19]} {c[25]} {a[11]} {a[9]} {b[17]} {b[7]} {a[1]} {c[15]} {c[5]} {b[30]} {a[22]} {b[28]} {b[20]} {c[26]} {a[12]} {b[18]} {a[2]} {b[8]} {b[10]} {c[16]} {b[0]} {c[6]} {b[31]} {a[23]} {b[29]} {b[21]} {c[27]} {a[13]} {b[19]} {a[3]} {b[9]} {b[11]} {c[17]} {b[1]} {c[7]} {a[24]} {c[30]} c_in {b[22]} {c[28]} {a[14]} {c[20]} {a[4]} {b[12]} {c[18]} {b[2]} {c[8]} {c[10]} {c[0]} {a[25]} {c[31]} {b[23]} {c[29]} {a[15]} {c[21]} {a[5]} {b[13]} {c[19]} {b[3]} {c[9]} {c[11]} {c[1]} {a[26]}"
set_input_delay -clock CLK_0 -min -rise 0.5 "{b[24]} {a[16]} {c[22]} {a[6]} {b[14]} {b[4]} {c[12]} {c[2]} {a[27]} {b[25]} {a[17]} {c[23]} {a[7]} {b[15]} rst_n {b[5]} {a[30]} {c[13]} {c[3]} {a[28]} {a[20]} {b[26]} {a[18]} {c[24]} {a[8]} {a[10]} {b[16]} {b[6]} {a[0]} {a[31]} {c[14]} {c[4]} {a[29]} {a[21]} {b[27]} {a[19]} {c[25]} {a[11]} {a[9]} {b[17]} {b[7]} {a[1]} {c[15]} {c[5]} {b[30]} {a[22]} {b[28]} {b[20]} {c[26]} {a[12]} {b[18]} {a[2]} {b[8]} {b[10]} {c[16]} {b[0]} {c[6]} {b[31]} {a[23]} {b[29]} {b[21]} {c[27]} {a[13]} {b[19]} {a[3]} {b[9]} {b[11]} {c[17]} {b[1]} {c[7]} {a[24]} {c[30]} c_in {b[22]} {c[28]} {a[14]} {c[20]} {a[4]} {b[12]} {c[18]} {b[2]} {c[8]} {c[10]} {c[0]} {a[25]} {c[31]} {b[23]} {c[29]} {a[15]} {c[21]} {a[5]} {b[13]} {c[19]} {b[3]} {c[9]} {c[11]} {c[1]} {a[26]}"
set_input_delay -clock CLK_0  -min -fall 0.5 "{b[24]} {a[16]} {c[22]} {a[6]} {b[14]} {b[4]} {c[12]} {c[2]} {a[27]} {b[25]} {a[17]} {c[23]} {a[7]} {b[15]} rst_n {b[5]} {a[30]} {c[13]} {c[3]} {a[28]} {a[20]} {b[26]} {a[18]} {c[24]} {a[8]} {a[10]} {b[16]} {b[6]} {a[0]} {a[31]} {c[14]} {c[4]} {a[29]} {a[21]} {b[27]} {a[19]} {c[25]} {a[11]} {a[9]} {b[17]} {b[7]} {a[1]} {c[15]} {c[5]} {b[30]} {a[22]} {b[28]} {b[20]} {c[26]} {a[12]} {b[18]} {a[2]} {b[8]} {b[10]} {c[16]} {b[0]} {c[6]} {b[31]} {a[23]} {b[29]} {b[21]} {c[27]} {a[13]} {b[19]} {a[3]} {b[9]} {b[11]} {c[17]} {b[1]} {c[7]} {a[24]} {c[30]} c_in {b[22]} {c[28]} {a[14]} {c[20]} {a[4]} {b[12]} {c[18]} {b[2]} {c[8]} {c[10]} {c[0]} {a[25]} {c[31]} {b[23]} {c[29]} {a[15]} {c[21]} {a[5]} {b[13]} {c[19]} {b[3]} {c[9]} {c[11]} {c[1]} {a[26]}"
set_output_delay -clock CLK_0  -max -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} c_out {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0 -max -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} c_out {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0 -min -rise 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} c_out {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"
set_output_delay -clock CLK_0  -min -fall 0.2 "{s[3]} {s[22]} {s[29]} {s[30]} {s[12]} {s[19]} {s[1]} {s[20]} {s[8]} {s[27]} {s[10]} {s[17]} {s[6]} {s[25]} {s[15]} {s[4]} {s[23]} {s[31]} {s[13]} {s[2]} {s[21]} c_out {s[9]} {s[28]} {s[11]} {s[18]} {s[0]} {s[7]} {s[26]} {s[16]} {s[5]} {s[24]} {s[14]}"

compile_ultra

write -f verilog -h -o csa_GLN.v

write_sdf csa_GLN.sdf
write_sdc csa_GLN.sdc